/*
Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт,
 какое число большее, а какое меньшее.

a = 5; b = 7 -> max = 7
a = 2 b = 10 -> max = 10
a = -9 b = -3 -> max = -3
*/

/*
Console.WriteLine("Input two different numbers");

int num1 = Convert.ToInt32(Console.ReadLine());

int num2 = Convert.ToInt32(Console.ReadLine());

if (num1>num2)
{
    Console.WriteLine($"{num1} > {num2} - первое число больше");
}
else
{
    Console.WriteLine($"{num2} > {num1} - второе число больше");
}
*/

/*
Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

2, 3, 7 -> 7
44 5 78 -> 78
22 3 9 -> 22
*/

/*
Console.WriteLine("Input three different numbers");

int num1 = Convert.ToInt32(Console.ReadLine());

int num2 = Convert.ToInt32(Console.ReadLine());

int num3 = Convert.ToInt32(Console.ReadLine());

if(num1>num2)
{
    if(num1>num3)
    {
        Console.WriteLine($"{num1} - первое число является максимальным");
    }
    else
    {
        Console.WriteLine($"{num3} - третье число является максимальным");
    }
}
else
{
    if(num2>num3)
    {
    
        Console.WriteLine($"{num2} - второе число является максимальным");
    }
    else
    {
        Console.WriteLine($"{num3} - третье число является максимальным");
    }
}
*/

/*
Задача 6: Напишите программу, которая на вход принимает число и выдаёт,
 является ли число чётным (делится ли оно на два без остатка).

4 -> да
-3 -> нет
7 -> нет
*/
/*
Console.WriteLine("Input a number");

int num = Convert.ToInt32(Console.ReadLine());

if(num%2==0)
{
    Console.WriteLine($"{num} - данное число является чётным");
}
else
{
    Console.WriteLine($"{num} - данное число является нечётным");
}
*/
